#!/bin/bash

# Έλεγχος αν δόθηκε το όρισμα του ονόματος του αρχείου
if [ "$#" -ne 1 ]; then
    echo "Παρακαλώ δώστε το όνομα του αρχείου ως όρισμα."
    exit 1
fi

output_file="$1"  # Το όνομα του αρχείου που θα δημιουργηθεί

# Εάν το αρχείο υπάρχει, διαγραφή του
if [ -e "$output_file" ]; then
    rm "$output_file"
fi

# Δημιουργία 10 γραμμών
for i in {1..10}; do
    # Χρησιμοποιώντας το /dev/urandom για να πάρουμε 100 τυχαίους χαρακτήρες
    # και το tr για να περιορίσουμε τους χαρακτήρες σε αλφαριθμητικούς
    cat /dev/urandom | tr -dc 'a-zA-Z0-9' | fold -w 100 | head -n 1 >> "$output_file"
done

echo "Το αρχείο $output_file δημιουργήθηκε με επιτυχία!"
